RU/Files/day_2_Ext/ggiExamples/cyclicSegmentNonMatchingGGI/0/U.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5-dev                               |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U.boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    in
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    out
    {
        type            fixedValue;
        value           nonuniform List<vector> 
20
(
(-0.013084 0.499657 0)
(-0.0392161 0.498288 0)
(-0.0652407 0.495553 0)
(-0.0910865 0.491459 0)
(-0.116683 0.486018 0)
(-0.141959 0.479246 0)
(-0.166846 0.471159 0)
(-0.191276 0.461781 0)
(-0.215182 0.451138 0)
(-0.238498 0.439258 0)
(-0.26116 0.426174 0)
(-0.283106 0.411922 0)
(-0.304276 0.396541 0)
(-0.324613 0.380073 0)
(-0.344059 0.362563 0)
(-0.362563 0.344059 0)
(-0.380073 0.324613 0)
(-0.396541 0.304276 0)
(-0.411922 0.283106 0)
(-0.426174 0.26116 0)
)
;
    }
    bottom
    {
        type            cyclicGgi;
        value           uniform (0 0 0);
    }
    top
    {
        type            cyclicGgi;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
