RU/Files/day_2_Ext/ggiExamples/cyclicSegmentNonMatchingGGI/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices        
(
    (1 0 0)
    (5 0 0)
    (2.5 4.330127 0)
    (0.5 0.866025 0)
    (1 0 0.1)
    (5 0 0.1)
    (2.5 4.330127 0.1)
    (0.5 0.866025 0.1)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) banana (5 0.2 0.2 5 1 1 1 1 1 1 1 1)
);

edges           
(
    arc 0 3 (0.866025 0.5 0)
    arc 1 2 (4.330127 2.5 0)

    arc 4 7 (0.866025 0.5 0.1)
    arc 5 6 (4.330127 2.5 0.1)
);

patches         
(
    patch in
    (
        (0 4 7 3)
    )
    patch out
    (
        (2 6 5 1)
    )
    patch bottom
    (
        (1 5 4 0)
    )
    patch top
    (
        (3 7 6 2)
    )
    empty frontAndBack 
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
